{"character": "Ophelia", "merged_description": "Ophelia is a sweet and innocent young woman, beautiful and obedient to her father and brother. Controlled by the men in her life, she is used as a pawn in their schemes to uncover Hamlet's madness. Despite the mistreatment she faces from Hamlet and the tragic loss of her sanity, Ophelia remains maidenly and pure, singing songs about flowers even in her madness. Ultimately, she tragically drowns, in a final act of agency reclaiming control over her own life."}
{"character": "Claudius", "merged_description": "Claudius is the calculating and ambitious King of Denmark, Hamlet's uncle, and the play's antagonist. He murdered his brother, Old King Hamlet, in order to seize the throne and subsequently married Gertrude, his erstwhile sister-in-law. While appearing to be a rather dull man who enjoys the pleasures of the flesh, Claudius is actually driven by his insatiable sexual appetites and lust for power. Despite occasionally showing signs of guilt and human feeling, such as his seemingly sincere love for Gertrude, Claudius is ultimately a self-serving, cool, and relentlessly ambitious politician. As Hamlet's hatred and suspicion of Claudius intensifies, Claudius fears being found out and ultimately schemes to have his nephew-cum-son murdered. Despite briefly confessing his dark deeds in a soliloquy, Claudius never truly repents and remains focused on maintaining his power and control over Denmark, even as his illegitimate rule threatens the country's political viability."}
{"character": "Gertrude", "merged_description": "Gertrude is the Queen of Denmark, recently married to Claudius and mother to Hamlet. Despite her deep love for her son, she is portrayed as shallow and weak, prioritizing affection and status over moral rectitude and truth. Gertrude's complex character arc revolves around her controversial decision to marry her brother-in-law shortly after the death of her husband, which is perceived as cruel and lustful by Hamlet. Her motives and true nature are often obscured, with questions surrounding her awareness of Claudius's murderous ambition. Gertrude's actions and inactions highlight the play's themes of women's limited agency in a patriarchal society and the moral implications of selfish choices made to secure sociopolitical safety."}