{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Theseus", "description": "Duke of Athens, who is marrying Hippolyta as the play begins. He decrees that Hermia must marry Demetrius or be sentenced either to death or to life in a convent. At the end of the play, he insists that all of the lovers marry along with him and Hipployta and provides a humorous commentary to accompany the performance of \"Pyramus and Thisbe.\"", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Hippolyta", "description": "Queen of the Amazons, she is betrothed to Theseus. These two were once enemies, and Theseus won her in battle. In this play, she seems to have lost much of her fighting spirit, though she does not hesitate to voice her opinion, for example, following Theseus' choice of the play \"Pyramus and Thisbe.\"", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Lysander", "description": "Hermia's beloved. Egeus does not approve of Lysander, though we don't know why. Lysander claims to be Demetrius' equal, and the play supports this claim — the differences between the two lovers are negligible, if not nonexistent — yet Egeus insists Hermia marry Demetrius. Rather than lose his lover in this random way, Lysander plans to escape with her to his widowed aunt's home. During a night in the forest, Lysander is mistakenly doused by Puck with Oberon's love juice, causing him to fall briefly in love with Helena. Realizing the mistake, Oberon makes Puck reverse the spell, so by the end of the play, Lysander and Hermia are once again in love and marry.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Demetrius", "description": "He is in love with Hermia, and her father's choice of a husband for her. Similar to Lysander in most ways, Demetrius' only distinguishing characteristic is his fickleness in love. He once loved Helena but has cruelly abandoned her before the play begins. Not only does he reject Helena's deep love for him, but he vows to hurt, even rape, her if she doesn't leave him alone. With the help of Oberon's love juice, he relinquishes Hermia and marries Helena at the end of the play. Demetrius is the only character who is permanently affected by Oberon's love juice.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Hermia", "description": "Although she loves Lysander, her father insists she marry Demetrius or be put to death for disobedience of his wishes. Theseus softens this death sentence, declaring that Hermia choose Demetrius, death, or life in a convent. Rather than accept this dire fate, Hermia agrees to run away with Lysander. During the chaotic night in the woods, Hermia is shocked to see her beloved abandon her and declare his love for Helena. She is unaware of the mischief Oberon's love juice is playing with Lysander's vision. By the play's end, Puck has reversed the spell, and Lysander's true love for Hermia has been restored. Despite her father's continued opposition to their union, the two marry with Theseus' blessing.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Helena", "description": "She is the cruelly abused lover of Demetrius. Before the play begins, he has abandoned her in favor of Hermia. Helena doesn't understand the reason for his switch in affection, because she is as beautiful as Hermia. Desperate to win him back, Helena tries anything, even betraying Hermia, her best childhood friend, by revealing to the jealous Demetrius Lysander and Hermia's plan to escape Athens. With the help of Oberon's love juice, Demetrius finally falls back in love with Helena, and the two are married at the end of the play.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Oberon", "description": "The King of the Fairies, Oberon is fighting with Titania when the play begins because he wants custody of an Indian boy she is raising. He hatches a plan to win the boy away from her by placing love juice in her eyes. This juice causes her to fall rashly in love with Bottom. During her magic-induced love affair, Oberon convinces her to relinquish the boy, who Oberon will use as a page. Once he has the boy, Oberon releases Titania from her spell, and the two lovers are reunited. Oberon also sympathizes with Helena and has Puck place love juice in Demetrius' eyes so he falls in love with her. After Puck mistakenly anoints Lysander, Oberon insists Puck fix his mistake so that the true lovers are together by the end of the play. In the final scene, he and Titania bless all of the newlyweds.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Titania", "description": "Oberon's wife, she is Queen of the Fairies. Because of Titania's argument with Oberon, the entire human and natural world is in chaos. Oberon wants the Indian boy she is protecting, but Titania refuses to give him up because when his mother died in childbirth, she agreed to raise the boy. Following Oberon's application of the love juice to her eyes, Titania falls in love with Bottom, and Oberon takes the Indian boy from her. Once he has the boy, Oberon releases the spell, and he and Titania are reunited.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Puck, or Robin Goodfellow", "description": "Oberon's jester, Puck is responsible for mistakenly anointing Lysander with the love juice intended for Demetrius. Puck enjoys the comedy that ensues when Lysander and Demetrius are both in love with Helena but follows Oberon's orders to reunite the correct lovers. Puck has the final words of the play, emphasizing that the entire play was just a dream.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Nick Bottom", "description": "A weaver, Bottom plays Pyramus. He is the most outgoing of the group of actors, wishing to play all of the characters in \"Pyramus and Thisbe.\" Puck transforms him into an ass, and Titania falls in love with him. When Puck returns Bottom to his normal self, Bottom can't speak about what happened to him but vows to have Peter Quince write about it in a ballad to be called \"Bottom's Dream.\"", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Egeus", "description": "Hermia's tyrannical father. He capriciously declares that she must marry Demetrius or be put to death for disobedience; according to the law of Athens, daughters must obey their fathers or forfeit their lives. At the end of the play, he is shocked to learn that Lysander and Hermia tried to flee Athens and insists they should be punished. Theseus overrules him, making the lovers marry instead.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Philostrate", "description": "Theseus' Master of Revels, he arranges the selection of performances for Theseus' wedding. He tries to dissuade the wedding party from choosing \"Pyramus and Thisbe\" but is overruled by Theseus.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Peter Quince", "description": "A carpenter and the director of the group of actors who perform \"Pyramus and Thisbe,\" which he has written for the celebration following Theseus and Hippolyta's wedding.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Francis Flute", "description": "A bellows-mender, Flute plays the role of Thisbe. He is displeased to be given a woman's role because he wants to let his beard grow, but Quince assures him that he can play the part in a mask.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Tom Snout", "description": "Snout is a tinker and plays the role of Wall in \"Pyramus and Thisbe.\"", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Snug", "description": "A joiner, he plays the lion in \"Pyramus and Thisbe.\"", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Robin Starveling", "description": "A tailor, he represents Moonshine in \"Pyramus and Thisbe.\"", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Peaseblossom, Cobweb, Moth, Mustardseed", "description": "Titania's fairies.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/m/a-midsummer-nights-dream/character-list"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Robin Goodfellow (Puck)", "description": "A type of fairy called a \"puck,\" Puck is Oberon's faithful servant, but is also mischievous and enjoys nothing more than playing tricks and causing trouble. He has all sorts of magical abilities, from changing shape, to turning invisible, to assuming different people's voices, to transforming a man's head into an ass's head. He is not, however, beyond making a mistake, as his mix-up between Demetrius and Lysander makes clear.", "source": "LitCharts", "url": "https://web.archive.org/web/20230207191641/https://www.litcharts.com/lit/a-midsummer-nights-dream/characters/robin-goodfellow-puck"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Nick Bottom", "description": "A weaver who's supreme confidence in his acting skill convinces the other laborers to give him the lead role of Pyramus in their version of Pyramus and Thisbe. In fact, Bottom is a seriously incompetent actor who understands neither his lines nor theater in general. All this makes him a profoundly funny character. Because he has no idea he's incompetent, he never ceases to make long, overly dramatic speeches filled with incorrect references and outright absurdities. Even when Puck transforms his head into an ass's head, Bottom fails to realize it and takes it as unsurprising when Titania falls in love with him. Yet though Bottom is certainly extremely foolish and self-important, he means well.", "source": "LitCharts", "url": "https://web.archive.org/web/20230207191641/https://www.litcharts.com/lit/a-midsummer-nights-dream/characters/nick-bottom"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Hermia", "description": "The daughter of Egeus and the beloved of Lysander and Demetrius (at least at the beginning of the play). She is strong-willed, believes in her right to choose her husband based on love, and is fiercely loyal. When crossed, Hermia can become a downright vixen. Hermia is beautiful and has dark hair, though she's small in stature and somewhat sensitive about it.", "source": "LitCharts", "url": "https://web.archive.org/web/20230207191641/https://www.litcharts.com/lit/a-midsummer-nights-dream/characters/hermia"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Helena", "description": "She loves Demetrius, and at one time he returned her love. But before the play begins, he fell in love with Hermia and left Helena in despair. Because of Demetrius's abandonment of her, Helena lacks self-confidence and self-respect, going so far as to tell Demetrius that she'll love and follow him even if he treats her like his dog. She's also a bit conniving and desperate, willing to betray her friend Hermia's confidence in order to try to win back Demetrius's love. Physically, she's tall and blond.", "source": "LitCharts", "url": "https://web.archive.org/web/20230207191641/https://www.litcharts.com/lit/a-midsummer-nights-dream/characters/helena"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Lysander", "description": "An Athenian nobleman who loves Hermia. In many ways, he is the model of a constant lover. He risks death under Athenian law by coming up with the plan to elope into the woods with Hermia, and only strays from his loyalty to Hermia under the influence of the love juice. When the effect of the spell is removed, he returns to his true love.", "source": "LitCharts", "url": "https://web.archive.org/web/20230207191641/https://www.litcharts.com/lit/a-midsummer-nights-dream/characters/lysander"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Demetrius", "description": "An Athenian nobleman who also loves Hermia. Unlike Lysander, Demetrius is an inconstant lover. Before the events of the play, he wooed Helena, then rejected her and pursued Hermia. He can be cruel at times, as when he threatens to abandon Helena in the forest, and there's no indication he would ever have come to return Helena's love without the influence of the love potion.", "source": "LitCharts", "url": "https://web.archive.org/web/20230207191641/https://www.litcharts.com/lit/a-midsummer-nights-dream/characters/demetrius"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Oberon", "description": "The King of the Fairies and Titania's husband. Oberon is willful and demands obedience from his subjects, including his wife. When he's angry, he's not above using magic and plots to manipulate and humiliate in order to get his way. Yet at the same time he also seems to like using magic to fix problems he sees around him, particularly those having to do with love. He's had numerous extra-marital affairs.", "source": "LitCharts", "url": "https://web.archive.org/web/20230207191641/https://www.litcharts.com/lit/a-midsummer-nights-dream/characters/oberon"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Titania", "description": "The Queen of the Fairies and Oberon's wife. Titania is strong willed and independent, willing to fight her husband for control of the changeling boy. She is also powerful. Her fight with her husband causes nature to act strangely, and her fairies always follow her commands. She is not, however, immune to the power of the juice from the love-in-idleness flower. As a lover, she is doting, though jealous. It also seems that, like her husband, through the years she's had many an extra-marital amorous affair.", "source": "LitCharts", "url": "https://web.archive.org/web/20230207191641/https://www.litcharts.com/lit/a-midsummer-nights-dream/characters/titania"}
{"id": 1778, "book": "A Midsummer Night's Dream", "author": "William Shakespeare", "character": "Theseus", "description": "The Duke of Athens and the fiancé and later the husband of Hippolyta, Theseus is a strong and responsible leader who tries to be fair and sensitive. Though it is his duty to uphold the law, and he does so when both Lysander and Demetrius love Hermia, as soon as the lovers sort themselves out, he overrules Egeus' demand that Hermia marry Demetrius and let the lovers decide for themselves whom to marry. He also treats the laborers decently, despite the fact that their play is atrocious. Though a fearsome warrior (he captured Hippolyta, an Amazon queen, in battle), he is devoted to making her happy. Theseus is, however, extremely literal-minded, and gives little credence to the \"fantasies\" the lovers recount of their night in the forest.", "source": "LitCharts", "url": "https://web.archive.org/web/20230207191641/https://www.litcharts.com/lit/a-midsummer-nights-dream/characters/theseus"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Hamlet", "description": "The Prince of Denmark, the title character, and the protagonist. About thirty years old at the start of the play, Hamlet is the son of Queen Gertrude and the late King Hamlet, and the nephew of the present king, Claudius. Hamlet is melancholy, bitter, and cynical, full of hatred for his uncle’s scheming and disgust for his mother’s sexuality. A reflective and thoughtful young man who has studied at the University of Wittenberg, Hamlet is often indecisive and hesitant, but at other times prone to rash and impulsive acts.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Claudius", "description": "The King of Denmark, Hamlet’s uncle, and the play’s antagonist. The villain of the play, Claudius is a calculating, ambitious politician, driven by his sexual appetites and his lust for power, but he occasionally shows signs of guilt and human feeling—his love for Gertrude, for instance, seems sincere.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Gertrude", "description": "The Queen of Denmark, Hamlet’s mother, recently married to Claudius. Gertrude loves Hamlet deeply, but she is a shallow, weak woman who seeks affection and status more urgently than moral rectitude or truth.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Polonius", "description": "The Lord Chamberlain of Claudius’s court, a pompous, conniving old man. Polonius is the father of Laertes and Ophelia.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Ophelia", "description": "Polonius’s daughter, a beautiful young woman with whom Hamlet has been in love. Ophelia is a sweet and innocent young girl, who obeys her father and her brother, Laertes. Dependent on men to tell her how to behave, she gives in to Polonius’s schemes to spy on Hamlet. Even in her lapse into madness and death, she remains maidenly, singing songs about flowers and finally drowning in the river amid the flower garlands she had gathered.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Laertes", "description": "Polonius’s son and Ophelia’s brother, a young man who spends much of the play in France. Passionate and quick to action, Laertes is clearly a foil for the reflective Hamlet.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "The Ghost", "description": "The specter of Hamlet’s recently deceased father. The Ghost, who claims to have been murdered by Claudius, calls upon Hamlet to avenge him. However, it is not entirely certain whether the Ghost is what it appears to be, or whether it is something else. Hamlet speculates that the Ghost might be a devil sent to deceive him and tempt him into murder, and the question of what the Ghost is or where it comes from is never definitively resolved.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Horatio", "description": "Hamlet’s close friend, who studied with the prince at the university in Wittenberg. Horatio is loyal and helpful to Hamlet throughout the play. After Hamlet’s death, Horatio remains alive to tell Hamlet’s story.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Fortinbras", "description": "The young Prince of Norway, whose father the king (also named Fortinbras) was killed by Hamlet’s father (also named Hamlet). Now Fortinbras wishes to attack Denmark to avenge his father’s honor, making him another foil for Prince Hamlet.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Rosencrantz and Guildenstern", "description": "Two slightly bumbling courtiers, former friends of Hamlet from Wittenberg, who are summoned by Claudius and Gertrude to discover the cause of Hamlet’s strange behavior.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Osric", "description": "The foolish courtier who summons Hamlet to his duel with Laertes.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Voltimand and Cornelius", "description": "Courtiers whom Claudius sends to Norway to persuade the king to prevent Fortinbras from attacking.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Marcellus and Bernardo", "description": "The officers who first see the ghost walking the ramparts of Elsinore and who summon Horatio to witness it. Marcellus is present when Hamlet first encounters the ghost.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Francisco", "description": "A soldier and guardsman at Elsinore.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Reynaldo", "description": "Polonius’s servant, who is sent to France by Polonius to check up on and spy on Laertes.", "source": "SparkNotes", "url": "https://web.archive.org/web/2023/https:/www.sparknotes.com/shakespeare/hamlet/characters"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Hamlet", "description": "The son of Old Hamlet and Gertrude, thus Prince of Denmark. The ghost of Old Hamlet charges him with the task of killing his uncle, Claudius, for killing him and usurping the throne of Denmark. Hamlet is a moody, theatrical, witty, brilliant young man, perpetually fascinated and tormented by doubts and introspection.  It is famously difficult to pin down his true thoughts and feelings -- does he love Ophelia, and does he really intend to kill Claudius?  In fact, it often seems as though Hamlet pursues lines of thought and emotion merely for their experimental value, testing this or that idea without any interest in applying his resolutions in the practical world.  The variety of his moods, from manic to somber, seems to cover much of the range of human possibility.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Old Hamlet", "description": "The former King of Denmark.  Old Hamlet appears as a ghost and exhorts his son to kill Claudius, whom he claims has killed him in order to secure the throne and the queen of Denmark.  Hamlet fears (or at least says he fears) that the ghost is an imposter, an evil spirit sent to lure him to hell.  Old Hamlet's ghost reappears in Act Three of the play when Hamlet goes too far in berating his mother.  After this second appearance, we hear and see no more of him.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Claudius", "description": "Old Hamlet's brother, Hamlet's uncle, and Gertrude's newlywed husband.  He murdered his brother in order to seize the throne and subsequently married Gertrude, his erstwhile sister-in-law.  Claudius appears to be a rather dull man who is fond of the pleasures of the flesh, sex and drinking.  Only as the play goes on do we become certain that he is indeed guilty of murder and usurpation.  Claudius is the only character aside from Hamlet to have a soliloquy in the play.  When he is convinced that Hamlet has found him out, Claudius eventually schemes to have his nephew-cum-son murdered.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Gertrude", "description": "Old Hamlet's widow and Claudius' wife.  She seems unaware that Claudius killed her former husband.  Gertrude loves Hamlet tremendously, while Hamlet has very mixed feelings about her for marrying the (in his eyes) inferior Claudius after her first husband's death.  Hamlet attributes this need for a husband to her lustiness.  Gertrude figures prominently in many of the major scenes in the play, including the killing of Polonius and the death of Ophelia.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Horatio", "description": "Hamlet's closest friend.  They know each other from the University of Wittenberg, where they are both students.  Horatio is presented as a studious, skeptical young man, perhaps more serious and less ingenious than Hamlet but more than capable of trading witticisms with his good friend.  In a moving tribute just before the play-within-the-play begins, in Act Two scene two, Hamlet praises Horatio as his soul's choice and declares that he loves Horatio because he is \"not passion's slave\" but is rather good-humored and philosophical through all of life's buffets.  At the end of the play, Hamlet charges Horatio with the task of explaining the pile of bodies to the confused onlookers in court.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Polonius", "description": "The father of Ophelia and Laertes and the chief adviser to the throne of Denmark.  Polonius is a windy, pedantic, interfering, suspicious, silly old man, a \"rash, intruding fool,\" in Hamlet's phrase.  Polonius is forever fomenting intrigue and hiding behind tapestries to spy.  He hatches the theory that Ophelia caused Hamlet to go mad by rejecting him.  Polonius' demise is fitting to his flaws. Hamlet accidentally kills the old man while he eavesdrops behind an arras in Gertrude's bedroom.  Polonius' death causes his daughter to go mad.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Ophelia", "description": "The daughter of Polonius and sister of Laertes. Ophelia has received several tributes of love from Hamlet but rejects him after her father orders her to do so.  In general, Ophelia is controlled by the men in her life, moved around like a pawn in their scheme to discover Hamlet's distemper.  Moreover, Ophelia is regularly mocked by Hamlet and lectured by her father and brother about her sexuality.  She goes mad after Hamlet murders Polonius.  She later drowns.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Laertes", "description": "Polonius' son and Ophelia's brother.  Laertes is an impetuous young man who lives primarily in Paris, France.  We see him at the beginning of the play at the celebration of Claudius and Gertrude's wedding.  He then returns to Paris, only to return in Act Four with an angry entourage after his father's death at Hamlet's hands.  He and Claudius conspire to kill Hamlet in the course of a duel between Laertes and the prince.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Rosencrantz and Guildenstern", "description": "Friends of Hamlet's from the University of Wittenberg.  Claudius invites them to court in order to spy on Hamlet.  Rosencrantz and Guildenstern are often treated as comic relief; they are sycophantic, vaguely absurd fellows.  After Hamlet kills Polonius, Rosencrantz and Guildenstern are assigned to accompany Hamlet to England.  They carry a letter from Claudius asking the English king to kill Hamlet upon his arrival.  Hamlet discovers this plot and alters the letter so that Rosencrantz and Guildenstern are put to death instead.  We learn that they have indeed been executed at the very close of the play.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Fortinbras", "description": "The Prince of Norway. In many ways his story is parallel to Hamlet's: he too has lost his father by violence (Old Hamlet killed Old Fortinbras in single combat); he too is impeded from ascending the throne by an interfering uncle.  But despite their biographical similarities, Fortinbras and Hamlet are constitutional opposites.  Where Hamlet is pensive and mercurial, Fortinbras is all action.  He leads an army through Denmark in order to attack disputed territory in Poland.  At the end of the play, and with Hamlet's dying assent, Fortinbras assumes the crown of Denmark.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Osric", "description": "The ludicrous, flowery, stupid courtier who invites Hamlet to fence with Laertes, then serves as referee during the contest.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "The gravediggers", "description": "Two \"clowns\" (roles played by comic actors), a principal gravedigger and his assistant.  They figure only in one scene -- Act Five scene one -- yet never fail to make a big impression on readers and audience members.  The primary gravedigger is a very witty man, macabre and intelligent, who is the only character in the play capable of trading barbs with Hamlet.  They are the only speaking representatives of the lower classes in the play and their perspective is a remarkable contrast to that of the nobles.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "The players", "description": "A group of (presumably English) actors who arrive in Denmark.  Hamlet knows this company well and listens, enraptured, while the chief player recites a long speech about the death of Priam and the wrath of Hecuba.  Hamlet uses the players to stage an adaptation of \"The Death of Gonzago\" which he calls \"The Mousetrap\" -- a play that reprises almost perfectly the account of Old Hamlet's death as told by the ghost -- in order to be sure of Claudius' guilt.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "A Priest", "description": "Charged with performing the rites at Ophelia's funeral.  Because of the doubtful circumstances of Ophelia's death, the priest refuses to do more than the bare minimum as she is interred.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Reynaldo", "description": "Polonius' servant, sent to check on Laertes in Paris.  He receives absurdly detailed instructions in espionage from his master.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Bernardo", "description": "A soldier who is among the first to see the ghost of Old Hamlet.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Marcellus", "description": "A soldier who is among the first to see the ghost of Old Hamlet.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Francisco", "description": "A soldier.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Voltemand", "description": "A courtier.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Cornelius", "description": "A courtier.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "A Captain", "description": "A captain in Fortinbras' army who speaks briefly with Hamlet.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Ambassadors", "description": "Ambassadors from England who arrive at the play's close to announce that Rosencrantz and Guildenstern are dead.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/hamlet/study-guide/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Hamlet", "description": "Prince of Denmark, son of the late King Hamlet and Queen Gertrude, and nephew and stepson to Claudius. Hamlet is one of the most famous figures in Western literature, and, in the world of the theater, one of the most complicated, difficult, and yet sought-after roles ever created. Hamlet’s existentialism, immaturity, and layered, constructed personality make him an odd leading man—a protagonist in a revenge play that is less about the revenge itself and more about tearing down notions of whether vengeance is ever justified (or ever enough). Hamlet, a university student, delivers several long monologues and soliloquies throughout the play which plunge the depths of his psyche—or at least seem to—as he tries to figure out the difference between what society has led him to believe and what his own core beliefs truly are. For instance, though Hamlet’s father’s ghost charges him with securing vengeance for Claudius’s brutal act of regicide, Hamlet isn’t sure whether there is truly any honor in revenge—and his inability to decide one way or the other results in his halting, hobbling inaction, his endless musings on the nature of life and death, and his festering inability to tell the difference between what is real and what is perceived. Shakespeare uses Hamlet to explore the nihilism that takes over once one begins to see life and death as arbitrary and meaningless, and to imagine what cruelties, betrayals, and charades one might resort to as a result of that nihilism. Hamlet’s despicable treatment of his lover Ophelia and his mother Gertrude, his slaying of Polonius, and his public humiliation of Claudius are all consequences of his inability to act simply and decisively—and yet with every day that Hamlet refuses to take action, kill his murderous stepfather, and claim the throne for himself, the “rotten” core of Denmark grows more and more unstable, and vulnerable to foreign interference. Anxious, poetic, brooding, and yet oftentimes rebellious and playful, Hamlet’s contradictory personality, convoluted speeches, and tragic fate make him one of Shakespeare’s best-known characters, and one of theater’s greatest enigmas of all time.", "source": "LitCharts", "url": "https://web.archive.org/web/20230329004915/https://www.litcharts.com/lit/hamlet/characters/hamlet"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Claudius", "description": "Hamlet’s uncle and stepfather, and the new King of Denmark. After the death of Hamlet’s father and Claudius’s brother, the former king, Claudius married his brother’s wife, Gertrude, and assumed the throne of Denmark—much to Hamlet’s chagrin and suspicion. Early on in the play, the ghost of Hamlet’s father appears to Hamlet and tells him that Claudius murdered him for the throne, then charges Hamlet with avenging the murder. Hamlet’s hatred of Claudius intensifies after speaking with the ghost—but still, Hamlet is unable to take the action needed to get revenge for his father. Claudius, meanwhile, interprets Hamlet’s suspicion and anger as madness, and endeavors to find out the cause by recruiting Hamlet’s friends Rosencrantz and Guildenstern. Claudius fears that Hamlet is onto him, and when Hamlet arranges a performance of a play whose events mirror the manner of King Hamlet’s murder, Claudius at last confesses, in a lengthy soliloquy, to his dark, dastardly deeds. Alone on stage, Claudius tries to pray for forgiveness for his actions—but admits that he knows that without truly repenting in deed as well as in word, he will never be saved or absolved. Claudius, for all his words of regret, doesn’t actually feel regret about what he’s done—he’s happy to be on the throne, to be married to Gertrude, and to have power over Denmark. However, Claudius’s illegitimate rule is the “rotten” core of the country, and as relationships within Elsinore splinter and fall apart, Claudius’s bogus claim to the throne begins to threaten Denmark’s political viability against its rivals in Norway. Self-serving, cool, and relentlessly ambitious, Claudius’s arc ties in with several of the play’s major themes, including action and inaction, appearance versus reality, and poison, corruption, and death.", "source": "LitCharts", "url": "https://web.archive.org/web/20230329004915/https://www.litcharts.com/lit/hamlet/characters/claudius"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Gertrude", "description": "Hamlet’s mother, Claudius’s wife, and the Queen of Denmark. One of only two female characters in the play (along with Ophelia), Gertrude’s arc throughout the drama is perhaps most representative of the theme of women. Gertrude marries her brother-in-law, Claudius, very shortly after the death of her husband—an action perceived as cruel, obscene, lustful, and opportunistic by her son, Hamlet. In reality, this choice is one of the few options available to a woman of Gertrude’s time: a woman whose political safety and social standing is entirely dependent on her connection to and protection from a powerful man. Gertrude, then, is one of the play’s most complex characters, and one whose motives and truest nature are often obscured. For instance, when Hamlet confronts Gertrude about her choices, she admits that looking inward at her own choices—and considering the idea that her new husband murdered her old one—is too painful. Whether Gertrude is aware of Claudius’s murderous ambition on any level remains up for debate, but what is clear is that no matter how much she knows, she is willing to tamp it down in order to selfishly secure her own sociopolitical safety. Gertrude’s arc also ties in with the play’s theme of action and inaction—if, as the text overwhelmingly suggests, Gertrude knew that her husband was murdered by his brother and married Claudius anyway, then that choice is perhaps the play’s most profound example of how both action and inaction can have complex moral implications.", "source": "LitCharts", "url": "https://web.archive.org/web/20230329004915/https://www.litcharts.com/lit/hamlet/characters/gertrude"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Polonius", "description": "A councilor, or advisor, to Claudius, and the father of Ophelia and Laertes. Polonius is a verbose, faltering old man whose servile devotion to Claudius renders him slimy, untrustworthy, and pathetic in the eyes of Hamlet. Polonius is determined to do whatever it takes to stay in the good graces of the king and queen, and invents many different ways of spying on Hamlet in an attempt to win the monarchs’ continued favor. Petty, meddling, and hypocritical, Polonius meets his end when, hiding behind a tapestry in Gertrude’s chambers in order to listen in on a conversation between the queen and Hamlet, he lets out a noise—and Hamlet stabs his sword through the tapestry, not knowing who is behind it but furious at being spied upon by a “rat.” While Hamlet is a character crippled by inaction, Polonius is a character whose constant scheming and devising—in other words, his inability to stop taking new actions—is what ultimately kills him. Polonius’s arc also ties in with the plays’ theme of appearance versus reality—with all of his two-faced plotting and fawning deference in pursuit of political strength and favor, it’s impossible to tell who Polonius truly is or what he truly wants.", "source": "LitCharts", "url": "https://web.archive.org/web/20230329004915/https://www.litcharts.com/lit/hamlet/characters/polonius"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Ophelia", "description": "Polonius’s daughter, Laertes’ sister, and Hamlet’s lover. Along with Gertrude, Ophelia is the only other female character in the play, Ophelia’s actions and trajectory are unfortunately defined by the men around her. At the start of the play, Ophelia—who has been in a relationship of undetermined seriousness with Hamlet for an unspecified amount of time—is used as a pawn in her father Polonius’s attempt to help Claudius and Gertrude ascertain the source of Hamlet’s madness. Polonius believes a burgeoning rift between Ophelia and Hamlet is the cause—in reality, Hamlet is, unbeknownst to the others at Elsinore, affecting madness in order to seem less suspicious or threatening as he investigates his father’s murder. Ophelia, however, is ignorant of Hamlet’s plan—and as she interacts with him in service of her father’s plot, Hamlet becomes so hurt by her transparent betrayal that he begins acting like even more of a lunatic towards Ophelia, cruelly suggesting she become a nun and making lewd sexual remarks towards her at every available opportunity. Between Hamlet’s abuses—and his murder of Polonius—Ophelia eventually loses her own mind, succumbing fully to the madness at which Hamlet has only been playing. Ophelia eventually commits suicide, and though Hamlet claims to grieve her, no one—least of all Ophelia’s furious brother, Laertes—believes him. A tragic figure whose life and death alike are coopted by the men around her, Ophelia is nonetheless able to do the one thing Hamlet, for all his musings on his desire to take his own life, is never able to do: she kills herself, reclaiming through a tragic action the only measure of agency she’s had over her own life for as long as she’s lived it.", "source": "LitCharts", "url": "https://web.archive.org/web/20230329004915/https://www.litcharts.com/lit/hamlet/characters/ophelia"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "The Ghost", "description": "An otherworldly presence that visits Hamlet early on in the play. The ghost appears to Hamlet as his father, though alternate readings of the play allow for the possibilities that the ghost may be a figment of Hamlet’s imagination, a malevolent demon seeking to derail Hamlet’s life, or even an actor working on Claudius’s behalf in an attempt to drive Hamlet mad and exclude him from the line of succession to the throne. Hamlet, however, believes that the ghost is truly his father. When the ghost tells Hamlet that he was murdered by Claudius and charges the prince with seeking vengeance, Hamlet takes the ghost’s words to heart. Though Horatio, Marcellus, Barnardo, and Francisco can all see the ghost, it’s possible that the spirit can choose to whom it is visible. When the ghost reappears to Hamlet in Gertrude’s chambers, for example, Gertrude claims she can’t see the apparition—whether she is truly blind to it or is simply pretending to be is a matter of interpretation. The ghost is, in this way, at the center of several of the play’s themes: appearance versus reality; action and inaction; religion, honor, and revenge; as well as poison, death, and corruption. The ghost orders Hamlet to act and becomes frustrated with him when he doesn’t—at the same time, the ghost itself speaks of being trapped in a kind of purgatory, unable to move on to either heaven or hell until its will is done. The ghost serves as a constant reminder of death’s omnipotence and the possibility that the afterlife for which all souls are destined is not a particularly good place, regardless of one’s actions while living.", "source": "LitCharts", "url": "https://web.archive.org/web/20230329004915/https://www.litcharts.com/lit/hamlet/characters/the-ghost"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Rosencrantz and Guildenstern", "description": "A pair of Hamlet’s old school friends whom Claudius summons to Elsinore in order to help determine the source of Hamlet’s madness. After Rosencrantz and Guildenstern admit to Hamlet’s suspicions that they were recruited by the king and queen to spy on him, Hamlet accuses them of being “sponge[s]” who let themselves be taken advantage of by doing Claudius’s dirty work. Rosencrantz and Guildenstern are killed after Hamlet learns that Claudius is trying to have him executed, and forges a letter in Claudius’s handwriting ordering the execution of Rosencrantz and Guildenstern instead.", "source": "LitCharts", "url": "https://web.archive.org/web/20230329004915/https://www.litcharts.com/lit/hamlet/characters/rosencrantz-and-guildenstern"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Laertes", "description": "Ophelia’s brother and Polonius’s son. A student at a university in France, Laertes is gallant, worldly, hotheaded, and obsessed with his family’s honor. In hopes of avenging Polonius and Ophelia’s deaths, Laertes conspires with Claudius to murder Hamlet, challenging Hamlet to a duel armed with a poison-tipped sword. He succeeds in stabbing Hamlet with the sword, but their weapons are switched during the fight, and Hamlet fatally stabs Laertes with the poisoned sword as well. As he dies, Laertes is remorseful over the deaths of Hamlet and Gertrude (who unknowingly drank from a cup of poisoned wine, Claudius’s backup plan should the duel fail), and calls out to Hamlet that “the king’s to blame,” implicating Claudius in their murders. Hamlet, realizing the sword is poisoned, stabs Claudius and forces him to drink the poisoned wine. Just before Laertes perishes, he cries out that Claudius has gotten the fate he deserves, and that he forgives Hamlet.", "source": "LitCharts", "url": "https://web.archive.org/web/20230329004915/https://www.litcharts.com/lit/hamlet/characters/laertes"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Horatio", "description": "Hamlet’s closest friend and most trusted confidant. Horatio wants to help Hamlet get to the root of his father’s loss and take vengeance upon his murderer, but as Hamlet descends into inaction, volatility, and apparent madness, Horatio worries that Hamlet is getting in too deep and tries to warn his friend against risking his reputation and safety. Horatio urges Hamlet not to go through with the duel against Laertes, a warning that proves to be legitimate in the end, as Laertes’s plot with Claudius ends up killing Hamlet along with Gertrude and Laertes and Claudius themselves. While Hamlet is dying after Laertes stabs him with a poisoned sword, Horatio contemplates committing suicide by drinking from the same cup of poisoned wine Hamlet used to kill Claudius, demonstrating the deep loyalty he feels for Hamlet and his despair over losing his friend. However, Hamlet prevents Horatio from doing so, urging him to live on and share the truth of Hamlet’s story with the world.", "source": "LitCharts", "url": "https://web.archive.org/web/20230329004915/https://www.litcharts.com/lit/hamlet/characters/horatio"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Fortinbras", "description": "The Prince of Norway. A young leader motivated to conquer foreign lands, make a name for himself, and avenge his father’s death at the hands of Hamlet’s own father, Fortinbras is Hamlet’s opposite in every way. Fortinbras’s actions—heard of consistently throughout the play, even though Fortinbras himself is not seen on stage until the final act—serve as barbed reminders to Hamlet of his own stultifying inaction.", "source": "LitCharts", "url": "https://web.archive.org/web/20230329004915/https://www.litcharts.com/lit/hamlet/characters/fortinbras"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Yorick", "description": "The deceased royal jester, whose remains Hamlet cradles and plays with after a pair of gravediggers exhume his skull. Hamlet recalls Yorick, in one of the play’s most famous lines, as “a fellow of infinite jest,” and yet the prince’s macabre handling of the remains of the jester of his youth reflects the play’s darker themes of poison, corruption, and death.", "source": "LitCharts", "url": "https://web.archive.org/web/20230329004915/https://www.litcharts.com/lit/hamlet/characters/yorick"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Hamlet, Prince of Denmark", "description": "The crown prince of Denmark who returns from the university in Wittenberg, Germany, to find his father dead, his mother married to the king's brother Claudius, and Claudius newly self-crowned King.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Claudius, King of Denmark", "description": "Dead King Hamlet's brother who has usurped the throne and married his sister-in-law.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Gertrude, Queen of Denmark", "description": "Prince Hamlet's mother, King Hamlet's widow, King Claudius' wife.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "The Ghost", "description": "Spirit of the late King Hamlet, condemned to walk the earth until his soul is cleansed of its sins.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Polonius", "description": "The elderly Lord Chamberlain, chief counselor to Claudius.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Horatio", "description": "A commoner,  went to school with Hamlet and remains his loyal best friend.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Laertes", "description": "A student in Paris,  is Polonius' son and Ophelia's brother; he returns from school because of King Hamlet's death, leaves to go back to Paris, and then returns again after his own father's murder.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Ophelia", "description": "Daughter of Polonius, sister of Laertes,  is beloved of Hamlet.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Rosencrantz and Guildenstern", "description": "Classmates of Hamlet's in Wittenberg. Claudius summons them to Elsinore to spy on Prince Hamlet.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Fortinbras", "description": "King of Norway, bound to avenge his father's death by the Danes' hands.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Osric", "description": "Affected courtier who plays a minor role as the King's messenger and as umpire of the fencing match between Hamlet and Laertes.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Voltimand and Cornelius", "description": "Danish courtiers who are sent as ambassadors to the Court of Norway.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Marcellus and Barnardo", "description": "Danish officers on guard at the castle of Elsinore.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Francisco", "description": "Danish soldier on guard at the castle of Elsinore.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Reynaldo", "description": "Young man whom Polonius instructs and sends to Paris to observe and report on Laertes' conduct.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1787, "book": "Hamlet", "author": "William Shakespeare", "character": "Two Clowns (the Gravediggers)", "description": "Two Clowns (the Gravediggers) Two rustics (identified as clowns) who dig Ophelia's grave.", "source": "Cliffnotes", "url": "https://web.archive.org/web/20230330202918/https:/www.cliffsnotes.com/literature/h/hamlet/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Antonio", "description": "a Christian merchant of Venice, he agrees to vouch for a loan to Bassanio from Shylock by putting a pound of his flesh up as collateral.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Bassanio", "description": "the friend of Antonio who borrows three thousand ducats from him. He is also the suitor to Portia who chooses the correct casket and marries her.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Leonardo", "description": "Bassanio's servant.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Lorenzo", "description": "a friend of Bassanio and Antonio, the lover of Jessica.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Graziano", "description": "a friend of Bassanio and Antonio, he accompanies Bassanio to Belmont and marries Nerissa.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Salerio", "description": "a friend of Bassanio and Antonio.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Solanio", "description": "a friend of Bassanio and Antonio.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Shylock", "description": "a Jewish moneylender in Venice. He demands a pound of flesh from Antonio, but is forced to convert to Christianity by the end of the play. He loses his daughter Jessica and most of his wealth.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Jessica", "description": "Shylock's daughter who runs away with Lorenzo.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Tubal", "description": "a Jew.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Lancelot", "description": "a clown, first Shylock's servant and later Bassanio's, he also plays tricks on his father Gobbo.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Gobbo", "description": "the father of Lancelot.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Portia", "description": "a wealthy Christian heiress who must marry the man who chooses the correct casket with her picture in it. She later marries Bassanio and also plays the Doctor Balthasar who saves Antonio's life.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Nerissa", "description": "the attendant or waiting-gentlewoman to Portia who also plays the clerk at the court.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Balthasar", "description": "a servant of Portia.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Stefano", "description": "a servant of Portia.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Prince of Morocco", "description": "a suitor to Portia who fails to win her by incorrectly choosing the gold casket.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Prince of Aragon", "description": "a suitor to Portia who fails to win her by incorrectly choosing the silver casket.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Duke of Venice", "description": "an upholder of the law.", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}
{"id": 1779, "book": "Merchant of Venice", "author": "William Shakespeare", "character": "Magnificoes of Venice", "description": "", "source": "GradeSaver", "url": "https://web.archive.org/web/20230330202918/https://www.gradesaver.com/merchant-of-venice/study-guide/character-list"}